print("========Name Error 만들기=========")

# print(NameError만들기) #Name Error 발생
# 코드 위에서 아래로 실행되기 때문에 위에서 에러 발생하면 그 이후 코드 실행 x
print("NameError 만들기")  # 따옴표로 감싸주면 에러 x


# =============================
print("=======syntaxaError 만들기=======")

# print("온도) # 따옴표를 안닫음
# print("진동"  # 괄호를 안닫음

print("온도")  # 온도 출력
print("진동")  # 진동 출력


# print(온도,75) # 온도에 따옴표를 안넣음
# print("진동",2.3 # 끝부분 괄호를 안닫음
# print("압력":,4.0) # 압력:같이 따옴표를 안해줌


print("온도", 75)  # 온도에 따옴표를 넣어줌
print("진동", 2.3)  # 마지막 부분 괄호를 넣어줌
print("압력:", 4.0)  # 압력:에 따옴표를 넣어줌
